# Создайте словарь person, в котором будут присутствовать ключи name, age, city.
# Выведите значение возраста из словаря person.

person = {'name':'Aleksey', 'age':25, 'city':'Minsk'}
print(person['age'])